Repository: michael-bill/enigma-simulator
Catalog: EnigmaSimulator/Language/Dictionary/Lang.*.resx
Languages: ru

source: Add
ru: Добавить

# areYouSureMessage
source: Are you sure? The old transformation and current message will be lost
ru: Вы уверены? Старая конфигурация и текущее сообщение будет утеряно

# btnBackspace
source: Back
ru: Назад

# btnChangeViewRotors
source: Change View
ru: Сменить вид

source: Clear
ru: Очистить

# clipboardIsEmptyMessage
source: The clipboard is empty or there are no letters of the English alphabet in it
ru: Буфер обмена пуст или в нём нет букв английского алфавита

source: Config
ru: Конфиг

source: Configuration
ru: Конфигурация

source: Copy
ru: Копировать

source: Copyright
ru: Авторские права

# copyrightTitle
source: The program was created and written by Mikhail Biloshitsky. Here you can find contacts author:
ru: Программа была создана и написана Билошицким Михаилом. Тут вы можете найти контакты автора:

source: Delete
ru: Удалить

# emailCopiedMessage
source: The email was copied to the clipboard
ru: Email был скопирован в буфер обмена

# fileLoadedSuccessfully
source: Config loaded successfully
ru: Конфиг успешно загружен

# fileSavedSuccessfully
source: Config saved successfully
ru: Конфиг успешно сохранен

source: input
ru: Ввод

source: Message
ru: Сообщение

# openBlowserDialog
source: Open a page in a browser?
ru: Открыть страницу в браузере?

source: output
ru: Вывод

# outputCopiedMessage
source: The output was successfully copied to the clipboard
ru: Вывод успешно скопирован в буфер обмена

source: Paste
ru: Вставить

# plugboardLabelText
source: Plugboard replacements:
ru: Перестановки:

# plugboardTitle
source: Plugboard
ru: Коммут. панель

# randomSet
source: Random Key
ru: Случайный ключ

# reflectorLabel
source: Reflector type
ru: Тип рефлетора

source: Settings
ru: Настройки

# shareKeyButton
source: Share key
ru: Поставить ключ

# title
source: Enigma Simulator
ru: Enigma Симулятор

# сompartmentLabel
source: Compartment
ru: Отсек
